In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("c2_file.csv")

In [3]:
df

        a   b  c    d
0  yellow  10  2  3.2
1   green   2  3  8.1
2    blue   7  1  0.4

In [4]:
pd.read_csv("c2_file.csv", header=None)

        0   1  2    3
0       a   b  c    d
1  yellow  10  2  3.2
2   green   2  3  8.1
3    blue   7  1  0.4

In [5]:
pd.read_csv("c2_file.csv", names=["column 1", "column 2", "column 3", "column 4"])

  column 1 column 2 column 3 column 4
0        a        b        c        d
1   yellow       10        2      3.2
2    green        2        3      8.1
3     blue        7        1      0.4

In [6]:
pd.read_csv("c2_file.csv", index_col=0)

         b  c    d
a
yellow  10  2  3.2
green    2  3  8.1
blue     7  1  0.4

In [7]:
df.dtypes

a     object
b      int64
c      int64
d    float64
dtype: object

In [8]:
df

        a   b  c    d
0  yellow  10  2  3.2
1   green   2  3  8.1
2    blue   7  1  0.4

In [9]:
df2 = pd.read_csv("c2_file.csv", dtype={"b": np.float64})
df2.dtypes

a     object
b    float64
c      int64
d    float64
dtype: object

In [10]:
df2

        a     b  c    d
0  yellow  10.0  2  3.2
1   green   2.0  3  8.1
2    blue   7.0  1  0.4

In [11]:
pd.read_csv("c2_file.csv", usecols=["a", "b"])

        a   b
0  yellow  10
1   green   2
2    blue   7

In [12]:
# import pandas as pd
pd.read_excel("c2_data.xls")

       varA      varB      varC
0  0.391723 -0.155122  0.381104
1  0.575125 -0.105817  0.232245
2  0.672305  0.424688 -0.694795
3  0.766115 -0.791350 -0.028739
4  0.677259 -0.817543 -0.537088
5 -0.029702 -0.891848 -0.682719
6 -0.161366 -0.659600 -0.727898
7  0.031672  0.016607 -0.940479
8  0.833212 -0.503236 -0.887210
9  0.907753  0.265177 -0.390762

In [13]:
pd.read_excel("c2_data.xls", sheet_name="Sheet2") # worksheet2

       varD      varE      varF
0  0.907753  0.265177 -0.390762
1  0.755019 -0.768056 -0.528307
2  0.850692 -0.537159 -0.601387
3  0.131663  0.941327  0.240073
4  0.574400  0.091735 -0.395277
5  0.816630  0.875612 -0.880044
6  0.536732  0.175428 -0.473053
7 -0.084641 -0.042827  0.053344
8  0.268271 -0.010628 -0.090952
9  0.166792 -0.872579 -0.556899

In [2]:
# import pandas as pd
pd.read_json("c2_frame.json")

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15

In [3]:
pd.read_json("c2_books.json")

                                               books
0  {'isbn': '9781593275846', 'title': 'Eloquent J...
1  {'isbn': '9781449331818', 'title': 'Learning J...
2  {'isbn': '9781449365035', 'title': 'Speaking J...

In [4]:
import json
from pandas import json_normalize

In [5]:
with open("c2_books.json", "r") as f:
    json_string = f.read()
    dictionary = json.loads(json_string)

In [6]:
json_normalize(dictionary, 'books')

,isbn,title,subtitle,author,published,publisher,pages,description,website
0,9781593275846,"Eloquent JavaScript, Second Edition",A Modern Introduction to Programming,Marijn Haverbeke,2014-12-14T00:00:00.000Z,No Starch Press,472,JavaScript lies at the heart of almost every m...,http://eloquentjavascript.net/
1,9781449331818,Learning JavaScript Design Patterns,A JavaScript and jQuery Developer's Guide,Addy Osmani,2012-07-01T00:00:00.000Z,O'Reilly Media,254,"With Learning JavaScript Design Patterns, you'...",http://www.addyosmani.com/resources/essentialj...
2,9781449365035,Speaking JavaScript,An In-Depth Guide for Programmers,Axel Rauschmayer,2014-02-01T00:00:00.000Z,O'Reilly Media,460,"Like it or not, JavaScript is everywhere these...",http://speakingjs.com/

### Reading HTML

In [7]:
import requests

In [8]:
page = requests.get(
"https://web.archive.org/web/20180908144902/en.proverbia.net/shortfamousquotes.asp"
)

In [9]:
page.text[0:100]

'\n<!DOCTYPE html>\n\n<html lang="en" xml:lang="en">\n<head><script type="text/javascript" src="https://w'

In [10]:
page.status_code

200

In [11]:
from bs4 import BeautifulSoup

In [12]:
soup = BeautifulSoup(page.text, "html.parser")

In [13]:
quotes = soup.find_all("blockquote")

In [14]:
quotes

[<blockquote>There is a natural aristocracy among men. The grounds of this are virtue and talents. </blockquote>,
 <blockquote>All our words from loose using have lost their edge. </blockquote>,
 <blockquote>God couldn't be everywhere, so he created mothers </blockquote>,
 <blockquote>Be not afraid of going slowly, be afraid only of standing still. </blockquote>,
 <blockquote>Learn from yesterday, live for today, hope for tomorrow. </blockquote>,
 <blockquote>Do not confine your children to your own learning, for they were born in another time. </blockquote>,
 <blockquote>I hear and I forget, I see and I remember. I do and I understand. </blockquote>,
 <blockquote>In teaching others we teach ourselves. </blockquote>,
 <blockquote>Happiness will never come to those who fail to appreciate what they already have. </blockquote>,
 <blockquote>Without His love I can do nothing, with His love there is nothing I cannot do. </blockquote>]

In [15]:
quotes[0].text

'There is a natural aristocracy among men. The grounds of this are virtue and talents. '

In [16]:
quote_list = []
for quote in quotes:
    string = quote.text
    quote_list.append(string)

In [17]:
quote_list

['There is a natural aristocracy among men. The grounds of this are virtue and talents. ',
 'All our words from loose using have lost their edge. ',
 "God couldn't be everywhere, so he created mothers ",
 'Be not afraid of going slowly, be afraid only of standing still. ',
 'Learn from yesterday, live for today, hope for tomorrow. ',
 'Do not confine your children to your own learning, for they were born in another time. ',
 'I hear and I forget, I see and I remember. I do and I understand. ',
 'In teaching others we teach ourselves. ',
 'Happiness will never come to those who fail to appreciate what they already have. ',
 'Without His love I can do nothing, with His love there is nothing I cannot do. ']

In [18]:
import pandas as pd
df = pd.DataFrame(quote_list, columns=["Quote"])
df

                                               Quote
0  There is a natural aristocracy among men. The ...
1  All our words from loose using have lost their...
2  God couldn't be everywhere, so he created moth...
3  Be not afraid of going slowly, be afraid only ...
4  Learn from yesterday, live for today, hope for...
5  Do not confine your children to your own learn...
6  I hear and I forget, I see and I remember. I d...
7            In teaching others we teach ourselves.
8  Happiness will never come to those who fail to...
9  Without His love I can do nothing, with His lo...

In [19]:
authors = soup.find_all("p", class_="a")

In [20]:
authors

[<p class="a">
 <a href="/web/20180908144902/http://en.proverbia.net/citasautor.asp?autor=13797" title="Thomas Jefferson Quotes">Thomas Jefferson</a> <span>(1743-1826) Third president of the United States.</span>
 </p>,
 <p class="a">
 <a href="/web/20180908144902/http://en.proverbia.net/citasautor.asp?autor=13355" title="Ernest Hemingway Quotes">Ernest Hemingway</a> <span>(1898-1961) American Writer.</span>
 </p>,
 <p class="a">
 <a href="/web/20180908144902/http://en.proverbia.net/citasautor.asp?autor=15888" title="Jewish proverb Quotes">Jewish proverb</a> <span></span>
 </p>,
 <p class="a">
 <a href="/web/20180908144902/http://en.proverbia.net/citasautor.asp?autor=15866" title="Chinese proverb Quotes">Chinese proverb</a> <span></span>
 </p>,
 <p class="a">
 <a href="/web/20180908144902/http://en.proverbia.net/citasautor.asp?autor=17381" title="Unknown Source Quotes">Unknown Source</a> <span></span>
 </p>,
 <p class="a">
 <a href="/web/20180908144902/http://en.proverbia.net/citasautor.asp?autor=15866" title="Chinese proverb Quotes">Chinese proverb</a> <span></span>
 </p>,
 <p class="a">
 <a href="/web/20180908144902/http://en.proverbia.net/citasautor.asp?autor=15866" title="Chinese proverb Quotes">Chinese proverb</a> <span></span>
 </p>,
 <p class="a">
 <a href="/web/20180908144902/http://en.proverbia.net/citasautor.asp?autor=15855" title="Proverb Quotes">Proverb</a> <span></span>
 </p>,
 <p class="a">
 <a href="/web/20180908144902/http://en.proverbia.net/citasautor.asp?autor=17381" title="Unknown Source Quotes">Unknown Source</a> <span></span>
 </p>,
 <p class="a">
 <a href="/web/20180908144902/http://en.proverbia.net/citasautor.asp?autor=17381" title="Unknown Source Quotes">Unknown Source</a> <span></span>
 </p>]

In [21]:
authors[0].text

'\nThomas Jefferson (1743-1826) Third president of the United States.\n'

In [22]:
authors[0].text[1:-1]

'Thomas Jefferson (1743-1826) Third president of the United States.'

In [23]:
author_list = []
for author in authors:
    string = author.text[1:-1]
    author_list.append(string)
df["Author"] = author_list
df

,Quote,Author
0,There is a natural aristocracy among men. The ...,Thomas Jefferson (1743-1826) Third president o...
1,All our words from loose using have lost their...,Ernest Hemingway (1898-1961) American Writer.
2,"God couldn't be everywhere, so he created moth...",Jewish proverb
3,"Be not afraid of going slowly, be afraid only ...",Chinese proverb
4,"Learn from yesterday, live for today, hope for...",Unknown Source
5,Do not confine your children to your own learn...,Chinese proverb
6,"I hear and I forget, I see and I remember. I d...",Chinese proverb
7,In teaching others we teach ourselves.,Proverb
8,Happiness will never come to those who fail to...,Unknown Source
9,"Without His love I can do nothing, with His lo...",Unknown Source

### Special case:scraping tables

Single table

In [24]:
tables = pd.read_html("https://world.openfoodfacts.org/additives")

In [25]:
print(len(tables))

1

In [26]:
print(tables[0].head())

                   Additive  Products   * Risk
0        E330 - Citric acid    197970 NaN  NaN
1          E322 - Lecithins    131976 NaN  NaN
2          E322i - Lecithin    110584 NaN  NaN
3  E500 - Sodium carbonates     82999 NaN  NaN
4        E415 - Xanthan gum     68782 NaN  NaN

Many tables

In [27]:
tables = pd.read_html(
"https://en.wikipedia.org/wiki/World_record_progression_50_metres_freestyle"
)
print(len(tables))

10

In [ ]:
tables # all the tables will be displayed

In [29]:
tables[0].head()

,#,Time,Unnamed: 2,Name,Nationality,Date,Meet,Location,Ref
0,1,23.86,†,Jonty Skinner,South Africa,"Aug 14, 1976",US National Championships,"Philadelphia, Pennsylvania, United States",NaN
1,2,23.74,NaN,Joe Bottom,United States,"Jul 3, 1977",Canada Cup,"Etobicoke, Canada",NaN
2,3,23.72,NaN,Ron Manganiello,United States,"Jul 29, 1978",-,"Miami, Florida, United States",NaN
3,4,23.70,NaN,Klaus Steinbach,West Germany,"Jul 23, 1979",-,"Freiburg, West Germany",NaN
4,5,23.66,NaN,Chris Cavanaugh,United States,"Feb 2, 1980",International Invitational,"Amersfoort, Netherlands",NaN

In [31]:
print(tables[1].head())

   #   Time Unnamed: 2             Name    Nationality              Date  \
0  1  21.76        NaN     Nils Rudolph   East Germany  10 February 1990
1  2  21.64        NaN    Steve Crocker  United States     21 March 1992
2  3  21.60        NaN      Mark Foster  Great Britain  17 February 1993
3  4  21.50        NaN  Alexander Popov         Russia     13 March 1994
4  5  21.48          h      Mark Foster  Great Britain  13 December 1998

                     Meet                      Location  Ref
0          FINA World Cup            Bonn, West Germany  NaN
1                       -  Dallas, Texas, United States  NaN
2               World Cup     Sheffield, United Kingdom  NaN
3               World Cup    Desenzano del Garda, Italy  NaN
4  European Championships     Sheffield, United Kingdom  NaN

In [32]:
print(tables[2].head())

   #   Time Unnamed: 2              Name    Nationality            Date  \
0  1  26.99       r, †    Kornelia Ender   East Germany    26 July 1975
1  2  26.95        NaN    Johanna Malloy         Canada  16 August 1977
2  3  26.74        NaN       Anne Jardin         Canada  19 August 1978
3  4  26.61          h  Cynthia Woodhead  United States   10 April 1980
4  5  26.53          h     Kelly Asplund  United States   10 April 1980

                               Meet                      Location  Ref
0               World Championships                Cali, Colombia  NaN
1             Canadian Summer Games        St. John's, NL, Canada  NaN
2            Canadian Championships             Etobicoke, Canada  NaN
3  US Spring National Championships  Austin, Texas, United States  NaN
4  US Spring National Championships  Austin, Texas, United States  NaN

In [33]:
print(tables[-2].head())

   Ath.#  Perf.#   Time              Athlete         Nation              Date  \
0    1.0     1.0  22.83       Gretchen Walsh  United States  15 December 2024
1    NaN     2.0  22.87             Walsh #2            NaN  14 December 2024
2    2.0     3.0  22.93  Ranomi Kromowidjojo    Netherlands     7 August 2017
3    3.0     4.0  23.00       Sarah Sjöström         Sweden     7 August 2017
4    NaN     5.0  23.02             Walsh #3            NaN  14 December 2024

      Place   Ref.
0  Budapest   [28]
1  Budapest   [27]
2    Berlin   [26]
3    Berlin   [26]
4  Budapest  [113]

In [38]:
tables = pd.read_html(
    "https://en.wikipedia.org/wiki/World_record_progression_50_metres_freestyle",
    match="Switzerland",
)
print(len(tables)) # 1
print(tables[0][10:15][["Time", "Name", "Nationality"]])

1
     Time          Name    Nationality
10  22.54   Robin Leamy  United States
11  22.52  Dano Halsall    Switzerland
12  22.40     Tom Jager  United States
13  22.33   Matt Biondi  United States
14  22.33   Matt Biondi  United States

In [36]:
tables = pd.read_html(
    "https://en.wikipedia.org/wiki/World_record_progression_50_metres_freestyle",
)
print(len(tables)) # 1
print(tables[0][0:50][["Time", "Name", "Nationality"]])

10
     Time                Name    Nationality
0   23.86       Jonty Skinner   South Africa
1   23.74          Joe Bottom  United States
2   23.72     Ron Manganiello  United States
3   23.70     Klaus Steinbach   West Germany
4   23.66     Chris Cavanaugh  United States
5   23.12     Chris Cavanaugh  United States
6   22.96        Rowdy Gaines  United States
7   22.83         Bruce Stahl  United States
8   22.83          Joe Bottom  United States
9   22.71          Joe Bottom  United States
10  22.54         Robin Leamy  United States
11  22.52        Dano Halsall    Switzerland
12  22.40           Tom Jager  United States
13  22.33         Matt Biondi  United States
14  22.33         Matt Biondi  United States
15  22.32           Tom Jager  United States
16  22.23           Tom Jager  United States
17  22.18      Peter Williams   South Africa
18  22.14         Matt Biondi  United States
19  22.12           Tom Jager  United States
20  21.98           Tom Jager  United States
21  21.81           Tom Jager  United States
22  21.64     Alexander Popov         Russia
23  21.56      Eamon Sullivan      Australia
24  21.50       Alain Bernard         France
25  21.41      Eamon Sullivan      Australia
26  21.28      Eamon Sullivan      Australia
27  20.94  Frédérick Bousquet         France
28  20.91         César Cielo         Brazil

In [37]:
tables = pd.read_html(
    "https://en.wikipedia.org/wiki/World_record_progression_50_metres_freestyle",
)
print(len(tables)) # 1
print(tables[0][["Time", "Name", "Nationality"]])

10
     Time                Name    Nationality
0   23.86       Jonty Skinner   South Africa
1   23.74          Joe Bottom  United States
2   23.72     Ron Manganiello  United States
3   23.70     Klaus Steinbach   West Germany
4   23.66     Chris Cavanaugh  United States
5   23.12     Chris Cavanaugh  United States
6   22.96        Rowdy Gaines  United States
7   22.83         Bruce Stahl  United States
8   22.83          Joe Bottom  United States
9   22.71          Joe Bottom  United States
10  22.54         Robin Leamy  United States
11  22.52        Dano Halsall    Switzerland
12  22.40           Tom Jager  United States
13  22.33         Matt Biondi  United States
14  22.33         Matt Biondi  United States
15  22.32           Tom Jager  United States
16  22.23           Tom Jager  United States
17  22.18      Peter Williams   South Africa
18  22.14         Matt Biondi  United States
19  22.12           Tom Jager  United States
20  21.98           Tom Jager  United States
21  21.81           Tom Jager  United States
22  21.64     Alexander Popov         Russia
23  21.56      Eamon Sullivan      Australia
24  21.50       Alain Bernard         France
25  21.41      Eamon Sullivan      Australia
26  21.28      Eamon Sullivan      Australia
27  20.94  Frédérick Bousquet         France
28  20.91         César Cielo         Brazil